### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_secret.onp_minecraft_prod_kagawa_secrets will be created
+   resource "kubernetes_secret" "onp_minecraft_prod_kagawa_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--kagawa--config-secrets"
+           namespace        = "seichi-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>